       *> ----------------------------------------------------- *
       *>   COPY DEL REGISTRO DEL ARCHIVO DE EMPLEADOS          *
       *> ----------------------------------------------------- *
           05 WS-REG-EMPLEADOS.
              10 WS-NUMERO-EMP     PIC 9(O5).
              10 WS-NOMBRE-EMP     PIC X(30).
              10 WS-STATUS-EMP     PIC 9(O1).
              10 WS-DEPTO-EMP      PIC 9(O3).
              10 WS-PUESTO-EMP     PIC 9(O2).
              10 WS-SALARIO-EMP    PIC 9(O7)V99.
