       010-ANIDADOS.
           IF CAMPO-A GREATER B
              IF CAMPO-E IS LESS CAMPO-F
                 PERFORM 020-CALCULO-01 THRU 020-FIN
              ELSE
                 PERFORM 030-CALCULO-02 THRU 030-FIN
              END-IF
           ELSE
              IF CAMPO-C EQUAL CAMPO-D
                 IF CAMPO-G EQUAL CAMPO-H
                    NEXT SENTENCE
                 ELSE
                    PERFORM 050-CALCULO-04 THRU 050-FIN
                 END-IF
              ELSE
                 PERFORM 040-CALCULO-03 THRU 040-FIN
              END-IF
           END-IF
           PERFORM 060-CALCULO-05 THRU 060-FIN.
